#include <stdio.h>
#include <stdlib.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <unistd.h>
#include <string.h>
#include "tcp_core.h"

char  *cmd[23] = {	"打开厨房灯",	"关闭厨房灯",	"打开抽油烟机",	"关闭抽油烟机",
	"打开餐厅灯",	"关闭餐厅灯",	"打开卫生间灯",	"关闭卫生间灯",	"打开次卧灯",
	"关闭次卧灯", 	"打开主卧灯",	"关闭主卧灯",	"打开主卧空调",	"打开主卧空调冷风",
	"打开主卧空调暖风",	"打开主卧空调除湿",	"打开视频监控",	"关闭视频监控",	"监控拍照",
	"开始播放音乐",	"暂停播放音乐",	"播放下一首音乐",	"播放上一首音乐"
};

char *code[23] = {"111", "110", "211", "210", "121", "120", "131", "130", 
					"141", "140", "151", "150",	"310", "311", "312", "313", 
					"511", "510", "512", "611", "610", "612", "613"};

int main(int argc, const char *argv[])
{


	return 0;
}
